/*************************************************************************
	> File Name: 1.10.1.c
	> Author: 
	> Mail: 
	> Created Time: 2016年01月10日 星期日 08时46分35秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    int a[8]={1,3,7,9,10,12,16,18};
    int s = 9,l=0,r=7;
    while(l+1<r)
    {
        if (a[(r+l)/2] < s){
            printf("l = %d\n",(r+l)/2);
            l =(r+l)/2;
        }
        else {
            printf("r= %d\n",(r+l)/2);
            r = (r+l)/2;
        }

    }
    printf("s is a[%d]\n",l+1);
    
}
